# Salaries By Major

Here we are going to analyse the data of salaries of American people by their college major.

## Syntax

First, we are going to import the pandas module.

In [1]:
import pandas as pd

Then, we are going to read the data from the csv file and store it in a pandas DataFrame.

In [2]:

df = pd.read_csv('salaries_by_college_major.csv')

This will show the first 5 rows of the data.

In [3]:

df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

We can see the number of rows and columns using this:

In [4]:
df.shape

(51, 6)

We can see the column names using this:

In [5]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

First, we need to check for the Not A Number (NaN) values.

In [6]:
df.isna()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
5,False,False,False,False,False,False
6,False,False,False,False,False,False
7,False,False,False,False,False,False
8,False,False,False,False,False,False
9,False,False,False,False,False,False
10,False,False,False,False,False,False
11,False,False,False,False,False,False
12,False,False,False,False,False,False
13,False,False,False,False,False,False
14,False,False,False,False,False,False
15,False,False,False,False,False,False
16,False,False,False,False,False,False
17,False,False,False,False,False,False
18,False,False,False,False,False,False
19,False,False,False,False,False,False
20,False,False,False,False,False,False
21,False,False,False,False,False,False
22,False,False,False,False,False,False
23,False,False,False,False,False,False
24,False,False,False,False,False,False
25,False,False,False,False,False,False
26,False,False,False,False,False,False
27,False,False,False,False,False,False
28,False,False,False,False,False,False
29,False,False,False,False,False,False
30,False,False,False,False,False,False
31,False,False,False,False,False,False
32,False,False,False,False,False,False
33,False,False,False,False,False,False
34,False,False,False,False,False,False
35,False,False,False,False,False,False
36,False,False,False,False,False,False
37,False,False,False,False,False,False
38,False,False,False,False,False,False
39,False,False,False,False,False,False
40,False,False,False,False,False,False
41,False,False,False,False,False,False
42,False,False,False,False,False,False
43,False,False,False,False,False,False
44,False,False,False,False,False,False
45,False,False,False,False,False,False
46,False,False,False,False,False,False
47,False,False,False,False,False,False
48,False,False,False,False,False,False
49,False,False,False,False,False,False
50,False,True,True,True,True,True

We can see the last 5 rows like this:

In [7]:
df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS
50,Source: PayScale Inc.,NaN,NaN,NaN,NaN,NaN

Remove the NaN values:

In [8]:
clean_df = df.dropna()
clean_df.tail()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
45,Political Science,40800.0,78200.0,41200.0,168000.0,HASS
46,Psychology,35900.0,60400.0,31600.0,127000.0,HASS
47,Religion,34100.0,52000.0,29700.0,96400.0,HASS
48,Sociology,36500.0,58200.0,30700.0,118000.0,HASS
49,Spanish,34000.0,53100.0,31000.0,96400.0,HASS

To access a particular column from a DataFrame we can use the square bracket notation, like so:

In [9]:
clean_df['Starting Median Salary']

0     46000.0
1     57700.0
2     42600.0
3     36800.0
4     41600.0
5     35800.0
6     38800.0
7     43000.0
8     63200.0
9     42600.0
10    53900.0
11    38100.0
12    61400.0
13    55900.0
14    53700.0
15    35000.0
16    35900.0
17    50100.0
18    34900.0
19    60900.0
20    38000.0
21    37900.0
22    47900.0
23    39100.0
24    41200.0
25    43500.0
26    35700.0
27    38800.0
28    39200.0
29    37800.0
30    57700.0
31    49100.0
32    36100.0
33    40900.0
34    35600.0
35    49200.0
36    40800.0
37    45400.0
38    57900.0
39    35900.0
40    54200.0
41    39900.0
42    39900.0
43    74300.0
44    50300.0
45    40800.0
46    35900.0
47    34100.0
48    36500.0
49    34000.0
Name: Starting Median Salary, dtype: float64

We can find the maximium value of the above column using this:

In [10]:
clean_df['Starting Median Salary'].max()

74300.0

To find the index for the row with the maximum value:

In [11]:
clean_df['Starting Median Salary'].idxmax()

43

To see the name of the major that corresponds to that particular row, we can use the .loc (location) property.

In [12]:
clean_df['Undergraduate Major'].loc[43]

'Physician Assistant'

Here we are selecting both a column ('Undergraduate Major') and a row at index 43, so we are retrieving the value of a particular cell. You can also use the double square brackets notation to achieve exactly the same thing:

In [13]:
clean_df['Undergraduate Major'][43]

'Physician Assistant'

If you don't specify a particular column you can use the .loc property to retrieve an entire row:

In [14]:
clean_df.loc[43]

Undergraduate Major                  Physician Assistant
Starting Median Salary                           74300.0
Mid-Career Median Salary                         91700.0
Mid-Career 10th Percentile Salary                66400.0
Mid-Career 90th Percentile Salary               124000.0
Group                                               STEM
Name: 43, dtype: object

## Examples

What college major has the highest mid-career salary?

In [15]:
max_mid_career_id = clean_df['Mid-Career Median Salary'].idxmax()
clean_df['Undergraduate Major'][max_mid_career_id]

'Chemical Engineering'

How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience).

In [16]:
clean_df['Mid-Career Median Salary'].max()

107000.0

Which college major has the lowest starting salary and how much do graduates earn after university?

In [17]:
min_starting_id = clean_df['Starting Median Salary'].idxmin()
print(clean_df['Undergraduate Major'][min_starting_id])
clean_df['Starting Median Salary'].min()

Spanish

34000.0

Which college major has the lowest mid-career salary and how much can people expect to earn with this degree?

In [18]:
clean_df.loc[clean_df['Mid-Career Median Salary'].idxmin()]

Undergraduate Major                  Education
Starting Median Salary                 34900.0
Mid-Career Median Salary               52000.0
Mid-Career 10th Percentile Salary      29300.0
Mid-Career 90th Percentile Salary     102000.0
Group                                     HASS
Name: 18, dtype: object

We can perform mathematical operations on entire columns.
To find the range of salaries for each major:

In [19]:
salary_range = clean_df['Mid-Career 90th Percentile Salary'] - clean_df['Mid-Career 10th Percentile Salary']
# or clean_df['Mid-Career 90th Percentile Salary'].subtract(clean_df['Mid-Career 10th Percentile Salary'])

Insert the new column (salary_range) into the DataFrame:

In [20]:
clean_df.insert(loc=1, column='Range', value=salary_range)
clean_df.head()

,Undergraduate Major,Range,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

To see which majors have the smallest range (and hence are lowest risk):

In [21]:
low_risk = clean_df.sort_values(by='Range')
low_risk[['Undergraduate Major', 'Range']].head()

           Undergraduate Major    Range
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

To find the majors with the highest potential (and hence highest values in the 90th percentile):

In [22]:
clean_df.sort_values(by='Mid-Career 90th Percentile Salary', ascending=False)[['Undergraduate Major', 'Mid-Career 90th Percentile Salary']].head()

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

To find the riskiest majors:

In [23]:
clean_df.sort_values(by='Range', ascending=False)[['Undergraduate Major', 'Range']].head()

   Undergraduate Major     Range
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

To find the degrees with the highest average salary:

In [24]:
clean_df.sort_values(by="Mid-Career Median Salary", ascending=False)[['Undergraduate Major', 'Mid-Career Median Salary']].head()

       Undergraduate Major  Mid-Career Median Salary
8     Chemical Engineering                  107000.0
12    Computer Engineering                  105000.0
19  Electrical Engineering                  103000.0
1    Aerospace Engineering                  101000.0
17               Economics                   98600.0

We have three categories in the 'Group' column: STEM, HASS and Business. Let's count how many majors we have in each category:

In [25]:
clean_df.groupby('Group')[['Undergraduate Major']].count()

          Undergraduate Major
Group
Business                   12
HASS                       22
STEM                       16

To find the average salary for each group:

In [26]:
# Displays the values with proper formatting (commas, decimals and dollar signs)
pd.options.display.float_format = '${:,.2f}'.format
clean_df.groupby('Group').mean()

,Range,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,
Business,"$103,958.33","$44,633.33","$75,083.33","$43,566.67","$147,525.00"
HASS,"$95,218.18","$37,186.36","$62,968.18","$34,145.45","$129,363.64"
STEM,"$101,600.00","$53,862.50","$90,812.50","$56,025.00","$157,625.00"